Jude-Zhu-Trial/Gut-Lernen/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_LV_USE_TINY_TTF=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_FREERTOS_HZ=1000

# button 组件默认 5ms 轮询单次采样 + 10ms 去抖,单次 ADC 噪声即可误触发。
# 20ms 轮询 x 3 tick 去抖 = 60ms 稳定窗口,再加 4 次过采样取均值。
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_DEBOUNCE_TICKS=3
CONFIG_ADC_BUTTON_SAMPLE_TIMES=4
